OpenEVSE/openevse_esp32_firmware/src/net_manager.cpp
  switch (event)
  {
    case ARDUINO_EVENT_WIFI_AP_START:
    {
      if(WiFi.softAPsetHostname(esp_hostname.c_str())) {
        DBUGF("Set host name to %s", WiFi.softAPgetHostname());
      } else {
        DBUGF("Setting host name failed: %s", esp_hostname.c_str());
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_START:
    {
      if(WiFi.setHostname(esp_hostname.c_str())) {
        DBUGF("Set host name to %s", WiFi.getHostname());
      } else {
        DBUGF("Setting host name failed: %s", esp_hostname.c_str());
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
    {
      auto& src = info.wifi_sta_connected;
      WiFiEventStationModeConnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.channel = src.channel;
      wifiOnStationModeConnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_STOP:
    {
    } break;

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    {
      auto& src = info.wifi_sta_disconnected;
      WiFiEventStationModeDisconnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.reason = static_cast<WiFiDisconnectReason>(src.reason);
      wifiOnStationModeDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    {
      auto& src = info.got_ip.ip_info;
      WiFiEventStationModeGotIP dst;
      dst.ip = src.ip.addr;
      dst.mask = src.netmask.addr;
      dst.gw = src.gw.addr;
      wifiOnStationModeGotIP(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_LOST_IP:
    {
      DBUGLN("Lost IP address");
      if(!isWiredConnected() && NetState::Connected == _state) {
        _state = NetState::StationClientConnecting;
        wifiStart();
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
    {
#if defined(ESP32) && !defined(EPOXY_DUINO)
#if ESP_ARDUINO_VERSION_MAJOR >= 3
      _ipv6address = WiFi.linkLocalIPv6().toString();
#else
      _ipv6address = WiFi.localIPv6().toString();
#endif
#endif
      DBUGF("WiFi STA IPv6: %s", _ipv6address.c_str());

      StaticJsonDocument<256> doc;
      doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
      doc["eth_connected"] = (int)net.isWiredConnected();
      doc["net_connected"] = (int)net.isWifiClientConnected();
      doc["ipaddress"] = net.getIp();
      doc["ipv6address"] = net.getIpv6();
      doc["macaddress"] = net.getMac();
      event_send(doc);
    } break;

    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    {
      auto& src = info.wifi_ap_staconnected;
      WiFiEventSoftAPModeStationConnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationConnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    {
      auto& src = info.wifi_ap_stadisconnected;
      WiFiEventSoftAPModeStationDisconnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_SCAN_DONE:
    {
      for(WiFiScanCompleteCallback callback : _scanCompleteCallbacks) {
        callback(info.wifi_scan_done.number);
      }

      _scanCompleteCallbacks.clear();
      WiFi.scanDelete();
      if(esid.length() > 0) {
        WiFi.setAutoReconnect(true);
      }
    } break;
#ifdef ENABLE_WIRED_ETHERNET
    case ARDUINO_EVENT_ETH_START:
      DBUGF("ETH Started, link %s", ETH.linkUp() ? "up" : "down");
      if(ETH.linkUp())
      {
        //set eth hostname here
        if(ETH.setHostname(esp_hostname.c_str())) {
          DBUGF("Set host name to %s", ETH.getHostname());
        } else {
          DBUGF("Setting host name failed: %s", esp_hostname.c_str());
        }
      } else {
        wifiStartInternal();
      }
      break;
    case ARDUINO_EVENT_ETH_CONNECTED:
      DBUGLN("ETH Connected");
#if ESP_ARDUINO_VERSION_MAJOR >= 3
      ETH.enableIPv6();
#else
      ETH.enableIpV6();
#endif
      break;
    case ARDUINO_EVENT_ETH_GOT_IP:
      DBUG("ETH MAC: ");
      DBUG(ETH.macAddress());
      DBUG(", IPv4: ");
      DBUG(ETH.localIP());
      if (ETH.fullDuplex()) {
        DBUG(", FULL_DUPLEX");
      }
      DBUG(", ");
      DBUG(ETH.linkSpeed());
      DBUGLN("Mbps");
      haveNetworkConnection(ETH.localIP());
      _macaddress = ETH.macAddress();
      _ethConnected = true;
      wifiStop();
      break;
    case ARDUINO_EVENT_ETH_GOT_IP6:
#if ESP_ARDUINO_VERSION_MAJOR >= 3
      _ipv6address = ETH.linkLocalIPv6().toString();
#else
      _ipv6address = ETH.localIPv6().toString();
#endif
      DBUGF("ETH IPv6: %s", _ipv6address.c_str());
      break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
      DBUGLN("ETH Disconnected");
      _ethConnected = false;
      wifiStart();
      break;
    case ARDUINO_EVENT_ETH_STOP:
      DBUGLN("ETH Stopped");
      _ethConnected = false;
      break;
#endif
    default:
      break;
  }
}
#endif

void NetManagerTask::setup()
{
  DBUGLN("Starting Network Manager");

  // This is not really needed for our usecase on the ESP32, because random(n) uses theESP32 hardware random number
  // generator, but random() does not so safest to add some entropy here
  randomSeed(millis() | analogRead(RANDOM_SEED_CHANNEL));

  // If we have an SSID configured at this point we have likely
  // been running another firmware, clear the results
  if(isWifiClientConfigured()) {
    WiFi.persistent(true);
    WiFi.disconnect();
    ESPAL.eraseConfig();
  }

  // Stop the WiFi module
  WiFi.persistent(false);
  WiFi.mode(WIFI_OFF);

#ifdef ESP32
  WiFi.onEvent(onNetEventStatic);
#else
// TODO: Needs fixing if we ever support ESP8622
//  static auto _onStationModeConnected = WiFi.onStationModeConnected(net_wifi_onStationModeConnected);
//  static auto _onStationModeGotIP = WiFi.onStationModeGotIP(net_wifi_onStationModeGotIP);
//  static auto _onStationModeDisconnected = WiFi.onStationModeDisconnected(net_wifi_onStationModeDisconnected);
//  static auto _onSoftAPModeStationConnected = WiFi.onSoftAPModeStationConnected(net_wifi_onAPModeStationConnected);
//  static auto _onSoftAPModeStationDisconnected = WiFi.onSoftAPModeStationDisconnected(net_wifi_onAPModeStationDisconnected);
#endif

