OpenEVSE/openevse_esp32_firmware/src/net_manager.cpp
  // Initially startup the netwrok to kick things off
  manageState();

  if (MDNS.begin(esp_hostname.c_str()))
  {
    MDNS.addService("http", "tcp", www_http_port);
    MDNS.addService("openevse", "tcp", www_http_port);
    MDNS.addServiceTxt("openevse", "tcp", "type", buildenv.c_str());
    MDNS.addServiceTxt("openevse", "tcp", "version", currentfirmware.c_str());
    MDNS.addServiceTxt("openevse", "tcp", "id", ESPAL.getLongId());
    
  }
}

unsigned long NetManagerTask::handleMessage()
{
  MicroTasks::Message *msg;
  if(this->receive(msg))
  {
    switch (msg->id())
    {
      case NetMessage::WiFiRestart:
      case NetMessage::WiFiStop:
        wifiStopInternal();
        if(msg->id() == NetMessage::WiFiStop) { break; };

      case NetMessage::WiFiStart:
        wifiStartInternal();
        break;

      case NetMessage::WiFiAccessPointEnable:
        wifiStartAccessPoint();
        break;

      case NetMessage::WiFiAccessPointDisable:
        wifiStopAccessPoint();
        break;

      case NetMessage::NetworkEvent:
      {
        NetworkEventMessage *netEvent = static_cast<NetworkEventMessage *>(msg);
        onNetEvent(netEvent->event(), netEvent->info());
      }break;

      default:
        break;
    }

    delete msg;
  }

  return MicroTask.Infinate;
}

unsigned long NetManagerTask::serviceButton()
{
  int button = _led.getButtonPressed();

  //DBUGF("%lu %d %d", millis() - _wifiButtonTimeOut, button, _wifiButtonState);
  if(_wifiButtonState != button)
  {
    _wifiButtonState = button;
    if(WIFI_BUTTON_PRESSED_STATE == button) {
      DBUGF("Button pressed");
      _wifiButtonTimeOut = millis();
      _apMessage = false;
    } else {
      DBUGF("Button released");
      if(millis() > _wifiButtonTimeOut + WIFI_BUTTON_AP_TIMEOUT) {
        wifiStartAccessPoint();
      } else {
        displayState();
      }
    }
  }

  if(WIFI_BUTTON_PRESSED_STATE == _wifiButtonState && millis() > _wifiButtonTimeOut + WIFI_BUTTON_FACTORY_RESET_TIMEOUT)
  {
    DBUGLN("*** Factory Reset ***");

    _lcd.display(F("Factory Reset"), 0, 0, 0, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);

    delay(1000);

    config_reset();
    ESPAL.eraseConfig();

    delay(50);
    ESPAL.reset();
  }
  else if(false == _apMessage && WIFI_BUTTON_PRESSED_STATE == _wifiButtonState && millis() > _wifiButtonTimeOut + WIFI_BUTTON_AP_TIMEOUT)
  {
    DBUGLN("*** Enable Access Point ***");

    _lcd.display(F("Access Point"), 0, 0, 0, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _apMessage = true;
  }

  return 0;
}

unsigned long NetManagerTask::manageState()
{
  unsigned long delayTime = MicroTask.Infinate;

  switch (_state)
  {
    case NetState::Starting:
      #ifdef ENABLE_WIRED_ETHERNET
      wiredStart();
      #else
      wifiStartInternal();
      #endif
      break;
#ifdef ENABLE_WIRED_ETHERNET
    case NetState::WiredConnecting:
      if(millis() > _wiredTimeout) {
        DBUGF("Wired connection timed out");
        wifiStartInternal();
      } else {
        delayTime = _wiredTimeout - millis();
      }
      break;
#endif
    case NetState::StationClientConnecting:
      if(_clientDisconnects > WIFI_CLIENT_DISCONNECTS_BEFORE_AP) {
        wifiStartAccessPoint();
      }
      // Intentionally fall through to AP State for the same client reconnect logic
    case NetState::AccessPointConnecting:
      if(!isWifiClientConnected() && esid != 0 && esid != "" &&
         WiFi.scanComplete() != WIFI_SCAN_RUNNING && millis() > _clientRetryTime) {
        wifiClientConnect();
      }

      delayTime = _clientRetryTime - millis();
      break;
    case NetState::StationClientReconnecting:
      break;
    case NetState::Connected:
      // Watchdog: if the disconnect event was missed, detect and recover here
      // rather than sitting in Connected state with no actual link.
      if(!isWifiClientConnected() && !isWiredConnected()) {
        DBUGLN("Watchdog: lost connection without disconnect event, reconnecting");
        _state = NetState::StationClientConnecting;
        wifiStart();
        break;
      }
      if(millis() > _apAutoApStopTime)
      {
        if(isWifiModeAp()) {
          wifiStopAccessPoint();
        }
      } else {
        delayTime = _apAutoApStopTime - millis();
      }
      break;
  }

  return delayTime;
}

unsigned long NetManagerTask::loop(MicroTasks::WakeReason reason)
{
  unsigned long nextLoopDelay = MicroTask.Infinate;

  Profile_Start(NetManagerTask::loop);

//  DBUG("NetManagerTask woke: ");
//  DBUG(NetState::Starting == _state ? "Starting" :
//       NetState::WiredConnecting == _state ? "WiredConnecting" :
//       NetState::AccessPointConnecting == _state ? "AccessPointConnecting" :
//       NetState::StationClientConnecting == _state ? "StationClientConnecting" :
//       NetState::StationClientReconnecting == _state ? "StationClientReconnecting" :
//       NetState::Connected == _state ? "Connected" :
//       "UNKNOWN");
//  DBUG(", ");
//  DBUGLN(WakeReason_Scheduled == reason ? "WakeReason_Scheduled" :
//         WakeReason_Event == reason ? "WakeReason_Event" :
//         WakeReason_Message == reason ? "WakeReason_Message" :
//         WakeReason_Manual == reason ? "WakeReason_Manual" :
//         "UNKNOWN");

  if(WakeReason_Message == reason) {
    nextLoopDelay = min(handleMessage(), nextLoopDelay);
  }

  nextLoopDelay = min(serviceButton(), nextLoopDelay);

  nextLoopDelay = min(manageState(), nextLoopDelay);

  if(_dnsServerStarted) {
    _dnsServer.processNextRequest(); // Captive portal DNS re-dierct
  }

  Profile_End(NetManagerTask::loop, 5);

  return nextLoopDelay;
}

#ifdef ENABLE_WIRED_ETHERNET
void NetManagerTask::wiredStart()
{
  DBUGLN("Starting wired connection");
  //ETH.setHostname(esp_hostname.c_str());
  // https://github.com/espressif/arduino-esp32/pull/6188/files
  pinMode(ETH_PHY_POWER, OUTPUT);
#ifdef RESET_ETH_PHY_ON_BOOT
  digitalWrite(ETH_PHY_POWER, LOW);
  delay(350);
#endif // #ifdef RESET_ETH_PHY_ON_BOOT
  digitalWrite(ETH_PHY_POWER, HIGH);
  ETH.begin();

